Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Enums/Семестры/Семестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Семестры</name>
  <enumValues>
    <name>Первый</name>
  </enumValues>
  <enumValues>
    <name>Второй</name>
  </enumValues>
  <enumValues>
    <name>Третий</name>
  </enumValues>
  <enumValues>
    <name>Четвертый</name>
  </enumValues>
  <enumValues>
    <name>Пятый</name>
  </enumValues>
  <enumValues>
    <name>Шестой</name>
  </enumValues>
  <enumValues>
    <name>Седьмой</name>
  </enumValues>
  <enumValues>
    <name>Восьмой</name>
  </enumValues>
  <enumValues>
    <name>Девятый</name>
  </enumValues>
  <enumValues>
    <name>Десятый</name>
  </enumValues>
  <enumValues>
    <name>Одиннадцатый</name>
  </enumValues>
  <enumValues>
    <name>Двенадцатый</name>
  </enumValues>
</mdclass:Enum>

Былков_ДА_70180166/src/Enums/Курсы/Курсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Курсы</name>
  <enumValues>
    <name>Первый</name>
  </enumValues>
  <enumValues>
    <name>Второй</name>
  </enumValues>
  <enumValues>
    <name>Третий</name>
  </enumValues>
  <enumValues>
    <name>Четвертый</name>
  </enumValues>
  <enumValues>
    <name>Пятый</name>
  </enumValues>
  <enumValues>
    <name>Шестой</name>
  </enumValues>
</mdclass:Enum>

Былков_ДА_70180166/src/Catalogs/Студенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СеместрПриИзменении(Элемент)   
	Значение = Объект.Семестр;
   	Объект.Курс = СеместрПриИзмененииНаСервере (Значение);
   КонецПроцедуры 

&НаСервере
Функция СеместрПриИзмененииНаСервере(Значение) 
    Если Значение = Перечисления.Семестры.Первый ИЛИ Значение = Перечисления.Семестры.Второй Тогда  
        Возврат Перечисления.Курсы.Первый; 
    ИначеЕсли Значение = Перечисления.Семестры.Третий ИЛИ Значение = Перечисления.Семестры.Четвертый Тогда  
        Возврат Перечисления.Курсы.Второй; 
    ИначеЕсли Значение = Перечисления.Семестры.Пятый ИЛИ Значение = Перечисления.Семестры.Шестой Тогда  
        Возврат Перечисления.Курсы.Третий; ;
    ИначеЕсли Значение = Перечисления.Семестры.Седьмой ИЛИ Значение = Перечисления.Семестры.Восьмой Тогда  
        Возврат Перечисления.Курсы.Четвертый; 
	ИначеЕсли Значение = Перечисления.Семестры.Девятый ИЛИ Значение = Перечисления.Семестры.Десятый Тогда  
        Возврат Перечисления.Курсы.Пятый;
	ИначеЕсли Значение = Перечисления.Семестры.Одиннадцатый ИЛИ Значение = Перечисления.Семестры.Двенадцатый Тогда  
        Возврат Перечисления.Курсы.Шестой; 
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ПроверитьУникальностьИндекса(Отказ, Объект.ЛичныйИндекс, Объект.Ссылка);
	ПроверитьУникальностьСтудБилета(Отказ, Объект.СтуденческийБилет, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИндекса(Отказ, ЛичныйИндекс, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.ЛичныйИндекс = &ЛичныйИндекс
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("ЛичныйИндекс", ЛичныйИндекс);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры    

&НаСервере
Процедура ПроверитьУникальностьСтудБилета(Отказ, СтуденческийБилет, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.СтуденческийБилет = &СтуденческийБилет
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("СтуденческийБилет", СтуденческийБилет);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой студенческий билет уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры
